{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "sadness",
    "1": "anger",
    "2": "love",
    "3": "surprise",
    "4": "fear",
    "5": "happy",
    "6": "joy",
    "7": "stress",
    "8": "neutral",
    "9": "anxiety"
  },
  "initializer_range": 0.02,
  "label2id": {
    "anger": 1,
    "anxiety": 9,
    "fear": 4,
    "happy": 5,
    "joy": 6,
    "love": 2,
    "neutral": 8,
    "sadness": 0,
    "stress": 7,
    "surprise": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "vocab_size": 30522
}
